{"class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"input_dtype": "float32", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>t\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "arguments": {}, "name": "lambda_1", "batch_input_shape": [null, 80, 320, 3], "function_type": "lambda", "output_shape_type": "raw", "output_shape": [80, 320, 3], "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_col": 8, "b_regularizer": null, "subsample": [4, 4], "init": "glorot_uniform", "W_regularizer": null, "activity_regularizer": null, "nb_filter": 16, "bias": true, "trainable": true, "nb_row": 8, "name": "convolution2d_1", "b_constraint": null, "W_constraint": null, "activation": "linear", "border_mode": "same", "dim_ordering": "tf"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_1"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "pool_size": [2, 2], "dim_ordering": "tf", "trainable": true, "border_mode": "valid", "strides": [2, 2]}}, {"class_name": "Convolution2D", "config": {"nb_col": 5, "b_regularizer": null, "subsample": [2, 2], "init": "glorot_uniform", "W_regularizer": null, "activity_regularizer": null, "nb_filter": 32, "bias": true, "trainable": true, "nb_row": 5, "name": "convolution2d_2", "b_constraint": null, "W_constraint": null, "activation": "linear", "border_mode": "same", "dim_ordering": "tf"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_2"}}, {"class_name": "Convolution2D", "config": {"nb_col": 5, "b_regularizer": null, "subsample": [2, 2], "init": "glorot_uniform", "W_regularizer": null, "activity_regularizer": null, "nb_filter": 64, "bias": true, "trainable": true, "nb_row": 5, "name": "convolution2d_3", "b_constraint": null, "W_constraint": null, "activation": "linear", "border_mode": "same", "dim_ordering": "tf"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_1"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_3"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "activation": "tanh", "bias": true, "trainable": true, "input_dim": 1920, "name": "dense_1", "output_dim": 1024, "b_constraint": null, "W_constraint": null, "init": "glorot_uniform"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_2"}}, {"class_name": "ELU", "config": {"alpha": 1.0, "trainable": true, "name": "elu_4"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "activation": "tanh", "bias": true, "trainable": true, "input_dim": 1024, "name": "dense_2", "output_dim": 512, "b_constraint": null, "W_constraint": null, "init": "glorot_uniform"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_3"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "activation": "tanh", "bias": true, "trainable": true, "input_dim": 512, "name": "dense_3", "output_dim": 1, "b_constraint": null, "W_constraint": null, "init": "glorot_uniform"}}], "keras_version": "1.2.0"}