{"config": [{"config": {"input_dtype": "float32", "output_shape_type": "raw", "name": "lambda_1", "batch_input_shape": [null, 80, 320, 3], "function_type": "lambda", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>}\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "arguments": {}, "trainable": true, "output_shape": [80, 320, 3]}, "class_name": "Lambda"}, {"config": {"W_regularizer": null, "name": "convolution2d_1", "nb_col": 8, "b_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "subsample": [4, 4], "activity_regularizer": null, "nb_filter": 16, "dim_ordering": "tf", "b_constraint": null, "activation": "linear", "bias": true, "border_mode": "same", "nb_row": 8, "trainable": true}, "class_name": "Convolution2D"}, {"config": {"name": "elu_1", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"strides": [2, 2], "name": "maxpooling2d_1", "dim_ordering": "tf", "border_mode": "valid", "pool_size": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"W_regularizer": null, "name": "convolution2d_2", "nb_col": 5, "b_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "subsample": [2, 2], "activity_regularizer": null, "nb_filter": 32, "dim_ordering": "tf", "b_constraint": null, "activation": "linear", "bias": true, "border_mode": "same", "nb_row": 5, "trainable": true}, "class_name": "Convolution2D"}, {"config": {"name": "elu_2", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"W_regularizer": null, "name": "convolution2d_3", "nb_col": 5, "b_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "subsample": [2, 2], "activity_regularizer": null, "nb_filter": 64, "dim_ordering": "tf", "b_constraint": null, "activation": "linear", "bias": true, "border_mode": "same", "nb_row": 5, "trainable": true}, "class_name": "Convolution2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"p": 0.2, "trainable": true, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"name": "elu_3", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"W_regularizer": null, "name": "dense_1", "b_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "activity_regularizer": null, "bias": true, "b_constraint": null, "activation": "tanh", "output_dim": 1024, "trainable": true, "input_dim": 1920}, "class_name": "Dense"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"name": "elu_4", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"W_regularizer": null, "name": "dense_2", "b_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "activity_regularizer": null, "bias": true, "b_constraint": null, "activation": "tanh", "output_dim": 512, "trainable": true, "input_dim": 1024}, "class_name": "Dense"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"W_regularizer": null, "name": "dense_3", "b_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "activity_regularizer": null, "bias": true, "b_constraint": null, "activation": "tanh", "output_dim": 1, "trainable": true, "input_dim": 512}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.0"}