{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "Lambda", "config": {"output_shape": [80, 320, 3], "name": "lambda_1", "input_dtype": "float32", "function_type": "lambda", "batch_input_shape": [null, 80, 320, 3], "output_shape_type": "raw", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u0083\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "arguments": {}, "trainable": true}}, {"class_name": "Convolution2D", "config": {"bias": true, "dim_ordering": "tf", "border_mode": "same", "subsample": [4, 4], "name": "convolution2d_1", "W_constraint": null, "init": "glorot_uniform", "nb_col": 8, "b_regularizer": null, "nb_row": 8, "nb_filter": 16, "activation": "linear", "b_constraint": null, "W_regularizer": null, "trainable": true, "activity_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_1", "trainable": true, "alpha": 1.0}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "pool_size": [2, 2], "strides": [2, 2], "name": "maxpooling2d_1", "trainable": true, "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"bias": true, "dim_ordering": "tf", "border_mode": "same", "subsample": [2, 2], "name": "convolution2d_2", "W_constraint": null, "init": "glorot_uniform", "nb_col": 5, "b_regularizer": null, "nb_row": 5, "nb_filter": 32, "activation": "linear", "b_constraint": null, "W_regularizer": null, "trainable": true, "activity_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_2", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"bias": true, "dim_ordering": "tf", "border_mode": "same", "subsample": [2, 2], "name": "convolution2d_3", "W_constraint": null, "init": "glorot_uniform", "nb_col": 5, "b_regularizer": null, "nb_row": 5, "nb_filter": 64, "activation": "linear", "b_constraint": null, "W_regularizer": null, "trainable": true, "activity_regularizer": null}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.2, "trainable": true}}, {"class_name": "ELU", "config": {"name": "elu_3", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"output_dim": 1024, "name": "dense_1", "bias": true, "input_dim": 1920, "init": "glorot_uniform", "trainable": true, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "activation": "tanh", "b_constraint": null, "W_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "p": 0.5, "trainable": true}}, {"class_name": "ELU", "config": {"name": "elu_4", "trainable": true, "alpha": 1.0}}, {"class_name": "Dense", "config": {"output_dim": 512, "name": "dense_2", "bias": true, "input_dim": 1024, "init": "glorot_uniform", "trainable": true, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "activation": "tanh", "b_constraint": null, "W_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "p": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"output_dim": 1, "name": "dense_3", "bias": true, "input_dim": 512, "init": "glorot_uniform", "trainable": true, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "activation": "tanh", "b_constraint": null, "W_regularizer": null}}]}