{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "Lambda", "config": {"input_dtype": "float32", "name": "lambda_1", "output_shape_type": "raw", "trainable": true, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u0084\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape": [80, 320, 3], "batch_input_shape": [null, 80, 320, 3], "function_type": "lambda", "arguments": {}}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_1", "border_mode": "same", "init": "glorot_uniform", "b_regularizer": null, "b_constraint": null, "activation": "linear", "nb_row": 8, "dim_ordering": "tf", "activity_regularizer": null, "bias": true, "nb_filter": 16, "trainable": true, "subsample": [4, 4], "W_constraint": null, "W_regularizer": null, "nb_col": 8}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_1"}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid", "name": "maxpooling2d_1"}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_2", "border_mode": "same", "init": "glorot_uniform", "b_regularizer": null, "b_constraint": null, "activation": "linear", "nb_row": 5, "dim_ordering": "tf", "activity_regularizer": null, "bias": true, "nb_filter": 32, "trainable": true, "subsample": [2, 2], "W_constraint": null, "W_regularizer": null, "nb_col": 5}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_2"}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_3", "border_mode": "same", "init": "glorot_uniform", "b_regularizer": null, "b_constraint": null, "activation": "linear", "nb_row": 5, "dim_ordering": "tf", "activity_regularizer": null, "bias": true, "nb_filter": 64, "trainable": true, "subsample": [2, 2], "W_constraint": null, "W_regularizer": null, "nb_col": 5}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_1"}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_3"}}, {"class_name": "Dense", "config": {"output_dim": 1024, "init": "glorot_uniform", "b_regularizer": null, "b_constraint": null, "input_dim": 1920, "activation": "linear", "activity_regularizer": null, "bias": true, "trainable": true, "W_constraint": null, "W_regularizer": null, "name": "dense_1"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_2"}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_4"}}, {"class_name": "Dense", "config": {"output_dim": 512, "init": "glorot_uniform", "b_regularizer": null, "b_constraint": null, "input_dim": 1024, "activation": "linear", "activity_regularizer": null, "bias": true, "trainable": true, "W_constraint": null, "W_regularizer": null, "name": "dense_2"}}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "mode": 0, "epsilon": 0.001, "trainable": true, "axis": -1, "name": "batchnormalization_1", "beta_regularizer": null, "gamma_regularizer": null}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_3"}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_5"}}, {"class_name": "Dense", "config": {"output_dim": 1, "init": "glorot_uniform", "b_regularizer": null, "b_constraint": null, "input_dim": 512, "activation": "tanh", "activity_regularizer": null, "bias": true, "trainable": true, "W_constraint": null, "W_regularizer": null, "name": "dense_3"}}]}