{"keras_version": "1.2.0", "config": [{"config": {"arguments": {}, "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>~\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "input_dtype": "float32", "batch_input_shape": [null, 80, 320, 3], "function_type": "lambda", "trainable": true, "name": "lambda_1", "output_shape": [80, 320, 3], "output_shape_type": "raw"}, "class_name": "Lambda"}, {"config": {"nb_filter": 16, "nb_row": 8, "bias": true, "name": "convolution2d_1", "init": "glorot_uniform", "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "trainable": true, "nb_col": 8, "dim_ordering": "tf", "activity_regularizer": null, "subsample": [4, 4], "b_constraint": null, "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_1"}, "class_name": "ELU"}, {"config": {"dim_ordering": "tf", "pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2], "trainable": true, "name": "maxpooling2d_1"}, "class_name": "MaxPooling2D"}, {"config": {"nb_filter": 32, "nb_row": 5, "bias": true, "name": "convolution2d_2", "init": "glorot_uniform", "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "trainable": true, "nb_col": 5, "dim_ordering": "tf", "activity_regularizer": null, "subsample": [2, 2], "b_constraint": null, "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_2"}, "class_name": "ELU"}, {"config": {"nb_filter": 64, "nb_row": 5, "bias": true, "name": "convolution2d_3", "init": "glorot_uniform", "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "trainable": true, "nb_col": 5, "dim_ordering": "tf", "activity_regularizer": null, "subsample": [2, 2], "b_constraint": null, "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.2}, "class_name": "Dropout"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_3"}, "class_name": "ELU"}, {"config": {"activity_regularizer": null, "input_dim": 1920, "b_constraint": null, "output_dim": 1024, "W_constraint": null, "init": "glorot_uniform", "bias": true, "b_regularizer": null, "activation": "linear", "W_regularizer": null, "trainable": true, "name": "dense_1"}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_4"}, "class_name": "ELU"}, {"config": {"activity_regularizer": null, "input_dim": 1024, "b_constraint": null, "output_dim": 512, "W_constraint": null, "init": "glorot_uniform", "bias": true, "b_regularizer": null, "activation": "linear", "W_regularizer": null, "trainable": true, "name": "dense_2"}, "class_name": "Dense"}, {"config": {"axis": -1, "beta_regularizer": null, "epsilon": 0.001, "momentum": 0.99, "gamma_regularizer": null, "mode": 0, "trainable": true, "name": "batchnormalization_1"}, "class_name": "BatchNormalization"}, {"config": {"name": "dropout_3", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_5"}, "class_name": "ELU"}, {"config": {"activity_regularizer": null, "input_dim": 512, "b_constraint": null, "output_dim": 1, "W_constraint": null, "init": "glorot_uniform", "bias": true, "b_regularizer": null, "activation": "tanh", "W_regularizer": null, "trainable": true, "name": "dense_3"}, "class_name": "Dense"}], "class_name": "Sequential"}